# SweptProfile Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SweptProfile Methods
SweptProfile Class See Also
---
The SweptProfile type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetDrivingCurve | Provides access to the curve that dictates the path of the swept profile. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetSweptProfile | Returns an object that describes the profile that is swept along the driving curve. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
SweptProfile Class
Autodesk.Revit.DB Namespace